Revit 2027 API
ForgeTypeId Constructor
 Constructs a ForgeTypeId holding an empty schema identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ForgeTypeId()
Public Sub New
public:
ForgeTypeId()
new : unit -> ForgeTypeId
See Also
Reference
ForgeTypeId Class
ForgeTypeId Overload
Autodesk.Revit.DB Namespace